BAS BMEKZU Project/src/Documents/ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете/ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете</name>
  <basedOn>Document.ИНАГРО_РеестрТТНВвоз</basedOn>
  <registerRecords>AccumulationRegister.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьВыдана</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЧерез</name>
    <comment>ФИО представителя контрагента, получившего товары по доверенности</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПодтверждающийПолномочия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучилПоДругомуДокументу</name>
    <comment>Получил по другому документу (не по доверенности)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДС</name>
    <comment>(Регл) </comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДСПодтвержденный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоАвансам</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоТаре</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовПоТареПоАвансам</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентом</name>
    <comment>(Регл) </comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПродаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактор</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУчитыватьНДС</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФормироватьРегистрациюВхНалоговогоДок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыЗакупки</name>
    <attributes>
      <name>ДокументОприходования</name>
      <type>
        <types>DocumentRef.ИНАГРО_ТТНВывоз</types>
        <types>DocumentRef.ИНАГРО_РеестрТТНВывозЖД</types>
        <types>DocumentRef.ИНАГРО_ТТНВывозЖД</types>
        <types>DocumentRef.ИНАГРО_СкладскаяКвитанция</types>
        <types>DocumentRef.ИНАГРО_РеестрТТНВвоз</types>
        <types>DocumentRef.ИНАГРО_РеестрТТНВывоз</types>
        <types>DocumentRef.ИНАГРО_ТТНВвозЖД</types>
        <types>DocumentRef.ИНАГРО_ТТНВвоз</types>
        <types>DocumentRef.ИНАГРО_РеестрТТНВвозЖД</types>
        <types>DocumentRef.ИНАГРО_Переоформление</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/AccumulationRegisters/ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете/ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете</name>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперацииВвозаВывозаСобственногоЗерна</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоставщикПолучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <comment>Склад</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ИНАГРО_ТТНВывоз</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВывозЖД</types>
      <types>DocumentRef.ИНАГРО_ТТНВывозЖД</types>
      <types>DocumentRef.ИНАГРО_СкладскаяКвитанция</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВвоз</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВывоз</types>
      <types>DocumentRef.ИНАГРО_ТТНВвозЖД</types>
      <types>DocumentRef.ИНАГРО_ТТНВвоз</types>
      <types>DocumentRef.ИНАГРО_РеестрТТНВвозЖД</types>
      <types>DocumentRef.ИНАГРО_Переоформление</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна/ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна</name>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяУслуга</name>
    <comment>Является ли услуга транспортной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмеряетсяТолькоВСуммовомВыражении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаНДС</name>
    <comment>Льгота по НДС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкСтрогогоУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитываетсяПоНоминальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСпецификацияНоменклатуры</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураГТД</name>
    <type>
      <types>CatalogRef.НоменклатураГТД</types>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоАкцизномуНалогу</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ВидПродукции</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыСХПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_УчитыватьВВедомостиДвижения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_Удобрение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_УдобрениеПроцент</name>
    <comment>Процент действующего вещества для удобрения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиницыИзмерения</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Documents/ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем мВалютаРегламентированногоУчета;
Перем мУчетнаяПолитика;

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	ИНАГРО_ЭлеваторЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
		 
	Если  ТипДанныхЗаполнения = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ВидОперации") Тогда
		ВидОперации = ДанныеЗаполнения.ВидОперации;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(Контрагент)
		И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Документы.ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете.ЗаполнитьСчетаУчетаРасчетов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();		
		
	Если ВидОперации = Перечисления.ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна.РеализацияТоваровУслуг Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДокументыЗакупки.Цена");
		МассивНепроверяемыхРеквизитов.Добавить("ДокументыЗакупки.Сумма");
		МассивНепроверяемыхРеквизитов.Добавить("ДокументыЗакупки.СтавкаНДС");
	КонецЕсли;	
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВесДокумента = 0;
	
	Для Каждого СтрДокументыЗакупки Из ДокументыЗакупки Цикл
		ВесДокумента = ВесДокумента + СтрДокументыЗакупки.Количество * СтрДокументыЗакупки.Коэффициент;
	КонецЦикла;
	
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаДокументыЗакупки, ТаблицаНакладных; 	
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента);	
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
		
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаДокументыЗакупки);
	
	ПодготовитьТаблицуНакладных(СтруктураШапкиДокумента, ТаблицаНакладных);
	
	// Движения по документу
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаНакладных, ДокументыЗакупки, Отказ, Заголовок, ТаблицаДокументыЗакупки);
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь(); 
		
КонецПроцедуры

#КонецОбласти

#Область Проведение

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента) Экспорт

	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаДокументыЗакупки)
	
	СтруктураПолей = Новый Структура;
	СтруктураПростыхПолей = Новый Структура;
	СтруктураСложныхПолей = Новый Структура;
	
	СтруктураПолей.Вставить("НомерСтрокиТабличнойЧастиТиповогоДокумента", "НомерСтроки");
	СтруктураПолей.Вставить("ВидОперацииВвозаВывозаСобственногоЗерна",    "Ссылка.ВидОперации");
	СтруктураПолей.Вставить("Организация",                                "Ссылка.Организация");	
	СтруктураПолей.Вставить("Склад",                                      "Ссылка.Склад");
	СтруктураПолей.Вставить("ПоставщикПолучатель",                        "Ссылка.Контрагент");
	СтруктураПолей.Вставить("ДоговорКонтрагента",                         "Ссылка.ДоговорКонтрагента");
	СтруктураПолей.Вставить("ДокументОприходования",                      "ДокументОприходования");
	СтруктураПолей.Вставить("Номенклатура",                               "Номенклатура");
	СтруктураПолей.Вставить("ЕдиницаИзмерения",                           "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Коэффициент",                                "Коэффициент");
	СтруктураПолей.Вставить("Количество",                                 "Количество");
	СтруктураПолей.Вставить("Вес",                                        "Количество * Коэффициент");
	СтруктураПолей.Вставить("Цена",                                       "Цена");
	СтруктураПолей.Вставить("Сумма",                                      "Сумма");
	СтруктураПолей.Вставить("СуммаНДС",                                   "СуммаНДС");
	СтруктураПолей.Вставить("СтавкаНДС",                                  "СтавкаНДС");
	
	РезультатЗапросаПоТоварам = ОбщегоНазначенияРед12.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ДокументыЗакупки", СтруктураПолей, ,СтруктураСложныхПолей);
	
	ТаблицаДокументыЗакупки = РезультатЗапросаПоТоварам.Выгрузить();
	
КонецПроцедуры

Процедура ПодготовитьТаблицуНакладных(СтруктураШапкиДокумента, ТаблицаНакладных)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДОК.ВидОперации КАК ВидОперацииВвозаВывозаСобственногоЗерна,
		|	ДОК.Организация КАК Организация,
		|	ДОК.Контрагент КАК ПоставщикПолучатель,
		|	ДОК.Склад КАК Склад,
		|	ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозСписокТТН.ТТН
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВывозСписокТТН.ТТН
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозЖДСписокТТН.ТТН
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНЖДВывозСписокТТН.ТТН
		|		ИНАЧЕ ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования
		|	КОНЕЦ КАК ДокументОприходования,
		|	ВЫБОР
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозСписокТТН.Вес
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВывозСписокТТН.Вес
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозЖДСписокТТН.ФизическийВес
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНЖДВывозСписокТТН.ФизическийВес
		|		ИНАЧЕ ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Количество * ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Коэффициент
		|	КОНЕЦ КАК Вес
		|ИЗ
		|	Документ.ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете.ДокументыЗакупки КАК ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВвоз.СписокТТН КАК ИНАГРО_РеестрТТНВвозСписокТТН
		|		ПО ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования = ИНАГРО_РеестрТТНВвозСписокТТН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВвозЖД.СписокТТН КАК ИНАГРО_РеестрТТНВвозЖДСписокТТН
		|		ПО ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования = ИНАГРО_РеестрТТНВвозЖДСписокТТН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВывоз.СписокТТН КАК ИНАГРО_РеестрТТНВывозСписокТТН
		|		ПО ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования = ИНАГРО_РеестрТТНВывозСписокТТН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВывозЖД.СписокТТН КАК ИНАГРО_РеестрТТНЖДВывозСписокТТН
		|		ПО ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете КАК ДОК
		|		ПО ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Ссылка = ДОК.Ссылка
		|ГДЕ
		|	ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДОК.ВидОперации,
		|	ДОК.Организация,
		|	ДОК.Контрагент,
		|	ДОК.Склад,
		|	ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Номенклатура,
		|	ВЫБОР
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозСписокТТН.ТТН
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВывозСписокТТН.ТТН
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозЖДСписокТТН.ТТН
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНЖДВывозСписокТТН.ТТН
		|		ИНАЧЕ ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозСписокТТН.Вес
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывоз
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВывозСписокТТН.Вес
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВвозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНВвозЖДСписокТТН.ФизическийВес
		|		КОГДА ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.ДокументОприходования ССЫЛКА Документ.ИНАГРО_РеестрТТНВывозЖД
		|				И ДОК.ВидОперации <> &ВидыОперацийИсключение
		|			ТОГДА ИНАГРО_РеестрТТНЖДВывозСписокТТН.ФизическийВес
		|		ИНАЧЕ ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Количество * ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчетеДокументыЗакупки.Коэффициент
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументСсылка",         Ссылка);
	Запрос.УстановитьПараметр("ВидыОперацийИсключение", Перечисления.ИНАГРО_ВидыОперацийВвозаВывозаСобственногоЗерна.ПоступлениеТоваров);
	
	РезЗапроса = Запрос.Выполнить();
	
	ТаблицаНакладных = РезЗапроса.Выгрузить();
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаНакладных, ДокументыЗакупки, Отказ, Заголовок, ТаблицаДокументыЗакупки)
	
	ДвижениеПоРегиструКонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированомУчете(РежимПроведения, СтруктураШапкиДокумента, ТаблицаНакладных, Отказ, Заголовок);
	
	ИнтерактивноеФормированиеТиповыхДокументов = ИНАГРО_ЭлеваторЗаполнениеДокументов.ПолучитьЗначениеПоУмолчанию("ИнтерактивноеФормированиеТиповыхДокументов");	
	Если ИнтерактивноеФормированиеТиповыхДокументов Тогда						
		ИНАГРО_Элеватор.СформироватьПодчиненныеДокументы(ЭтотОбъект, Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДвижениеПоРегиструКонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированомУчете(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	// Расход
	
	НаборДвижений = Движения.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете;
	
	СтруктТаблицДокумента = Новый Структура;
	СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
	
	ТаблицыДанныхДокумента = ИНАГРО_Общий.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
	
	ИНАГРО_Общий.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДокументуОснованию(Основание)
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИНАГРО_РеестрТТНВвоз") Тогда		
		
		Организация = Основание.Организация;
		Контрагент  = Основание.Поставщик;
		Склад       = Основание.Склад;
		
		ЗаполнитьПоОстаткамПокупка();
		
	КонецЕсли;
	
КонецПроцедуры		

Процедура ЗаполнитьПоОстаткамПокупка() Экспорт 
			
	ДокументыЗакупки.Очистить();
	
	Условие = " ИСТИНА ";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.ПоставщикПолучатель КАК Поставщик,
		|	ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.Организация КАК Организация,
		|	ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.Склад КАК Склад,
		|	ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.Номенклатура КАК Номенклатура,
		|	ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.ВесОстаток КАК ВесОстаток,
		|	ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.ДокументОприходования КАК ДокументОприходования,
		|	СПРНоменклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете.Остатки(
		|			&ДатаКон,
		|			Организация = &Организация
		|				И ПоставщикПолучатель = &ПоставщикПолучатель
		|				И Склад = &Склад
		|				И ВидОперацииВвозаВывозаСобственногоЗерна = &ВидОперации
		|				И &Условие) КАК ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СПРНоменклатура
		|		ПО ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчетеОстатки.Номенклатура = СПРНоменклатура.Ссылка"; 	
	
	Запрос.УстановитьПараметр("ДатаКон",             Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ПоставщикПолучатель", Контрагент);
	Запрос.УстановитьПараметр("Склад",               Склад);	
	Запрос.УстановитьПараметр("ВидОперации",         ВидОперации);	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 		
		
		НоваяСтрока = ДокументыЗакупки.Добавить();
		
		НоваяСтрока.ДокументОприходования = Выборка.ДокументОприходования;
		НоваяСтрока.Номенклатура          = Выборка.Номенклатура; 		
		НоваяСтрока.Количество            = Выборка.ВесОстаток		
			
	КонецЦикла;
	
	Документы.ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете.ЗаполнитьСведенияОНоменклатуреВТабличнойЧасти(ЭтотОбъект, "ДокументыЗакупки");
	
КонецПроцедуры

#КонецОбласти

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецЕсли
